cats_99/app/controllers/cats_controller.rb

INSERT INTO "cats" ("birth_date", "color", "name", "sex", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
    def create

        kitty = Cat.new(cat_params)
        if kitty.save

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "cats" SET "color" = $1, "description" = $2, "updated_at" = $3 WHERE "cats"."id" = $4  [["color", "grey"], ["description", "is a grumpy cat"], ["updated_at", "2021-02-05 21:48:00.523961"], ["id", 3]]
---
    def update
        kitty = Cat.find_by(id: params[:id])

        if kitty.update(cat_params)